Autodesk.Revit.DB.Electrical.InsulationType.IsInUse
Indicate whether the insulation type is in use.

Autodesk.Revit.DB.Electrical.InsulationType.Name
Get name of Insulation type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Set name can't be supported.

Autodesk.Revit.DB.Electrical.InsulationType
Represents electrical insulation type definition information.
Remarks: Insulation type is defined based on corresponding wire material type and temperature rating type.